{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1024], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200, 4], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "roi_pooling_conv_1", "class_name": "RoiPoolingConv", "config": {"name": "roi_pooling_conv_1", "trainable": true, "pool_size": 14, "num_rois": 200}, "inbound_nodes": [[["input_3", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "res5a_branch2a", "class_name": "TimeDistributed", "config": {"name": "res5a_branch2a", "trainable": true, "batch_input_shape": [null, 200, 14, 14, 1024], "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["roi_pooling_conv_1", 0, 0, {}]]]}, {"name": "bn5a_branch2a", "class_name": "TimeDistributed", "config": {"name": "bn5a_branch2a", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_1", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5a_branch2a", 0, 0, {}]]]}, {"name": "activation_41", "class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5a_branch2a", 0, 0, {}]]]}, {"name": "res5a_branch2b", "class_name": "TimeDistributed", "config": {"name": "res5a_branch2b", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_41", 0, 0, {}]]]}, {"name": "bn5a_branch2b", "class_name": "TimeDistributed", "config": {"name": "bn5a_branch2b", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_2", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5a_branch2b", 0, 0, {}]]]}, {"name": "activation_42", "class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5a_branch2b", 0, 0, {}]]]}, {"name": "res5a_branch2c", "class_name": "TimeDistributed", "config": {"name": "res5a_branch2c", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 2048, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_42", 0, 0, {}]]]}, {"name": "res5a_branch1", "class_name": "TimeDistributed", "config": {"name": "res5a_branch1", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 2048, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["roi_pooling_conv_1", 0, 0, {}]]]}, {"name": "bn5a_branch2c", "class_name": "TimeDistributed", "config": {"name": "bn5a_branch2c", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_3", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5a_branch2c", 0, 0, {}]]]}, {"name": "bn5a_branch1", "class_name": "TimeDistributed", "config": {"name": "bn5a_branch1", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_4", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5a_branch1", 0, 0, {}]]]}, {"name": "add_14", "class_name": "Add", "config": {"name": "add_14", "trainable": true}, "inbound_nodes": [[["bn5a_branch2c", 0, 0, {}], ["bn5a_branch1", 0, 0, {}]]]}, {"name": "activation_43", "class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"name": "res5b_branch2a", "class_name": "TimeDistributed", "config": {"name": "res5b_branch2a", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_43", 0, 0, {}]]]}, {"name": "bn5b_branch2a", "class_name": "TimeDistributed", "config": {"name": "bn5b_branch2a", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_5", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5b_branch2a", 0, 0, {}]]]}, {"name": "activation_44", "class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5b_branch2a", 0, 0, {}]]]}, {"name": "res5b_branch2b", "class_name": "TimeDistributed", "config": {"name": "res5b_branch2b", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_44", 0, 0, {}]]]}, {"name": "bn5b_branch2b", "class_name": "TimeDistributed", "config": {"name": "bn5b_branch2b", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_6", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5b_branch2b", 0, 0, {}]]]}, {"name": "activation_45", "class_name": "Activation", "config": {"name": "activation_45", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5b_branch2b", 0, 0, {}]]]}, {"name": "res5b_branch2c", "class_name": "TimeDistributed", "config": {"name": "res5b_branch2c", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "filters": 2048, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_45", 0, 0, {}]]]}, {"name": "bn5b_branch2c", "class_name": "TimeDistributed", "config": {"name": "bn5b_branch2c", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_7", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5b_branch2c", 0, 0, {}]]]}, {"name": "add_15", "class_name": "Add", "config": {"name": "add_15", "trainable": true}, "inbound_nodes": [[["bn5b_branch2c", 0, 0, {}], ["activation_43", 0, 0, {}]]]}, {"name": "activation_46", "class_name": "Activation", "config": {"name": "activation_46", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"name": "res5c_branch2a", "class_name": "TimeDistributed", "config": {"name": "res5c_branch2a", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_46", 0, 0, {}]]]}, {"name": "bn5c_branch2a", "class_name": "TimeDistributed", "config": {"name": "bn5c_branch2a", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_8", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5c_branch2a", 0, 0, {}]]]}, {"name": "activation_47", "class_name": "Activation", "config": {"name": "activation_47", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5c_branch2a", 0, 0, {}]]]}, {"name": "res5c_branch2b", "class_name": "TimeDistributed", "config": {"name": "res5c_branch2b", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_47", 0, 0, {}]]]}, {"name": "bn5c_branch2b", "class_name": "TimeDistributed", "config": {"name": "bn5c_branch2b", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_9", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5c_branch2b", 0, 0, {}]]]}, {"name": "activation_48", "class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5c_branch2b", 0, 0, {}]]]}, {"name": "res5c_branch2c", "class_name": "TimeDistributed", "config": {"name": "res5c_branch2c", "trainable": true, "layer": {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 2048, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_48", 0, 0, {}]]]}, {"name": "bn5c_branch2c", "class_name": "TimeDistributed", "config": {"name": "bn5c_branch2c", "trainable": true, "layer": {"class_name": "FixedBatchNormalization", "config": {"name": "fixed_batch_normalization_10", "trainable": true, "epsilon": 0.001, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null}}}, "inbound_nodes": [[["res5c_branch2c", 0, 0, {}]]]}, {"name": "add_16", "class_name": "Add", "config": {"name": "add_16", "trainable": true}, "inbound_nodes": [[["bn5c_branch2c", 0, 0, {}], ["activation_46", 0, 0, {}]]]}, {"name": "activation_49", "class_name": "Activation", "config": {"name": "activation_49", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_16", 0, 0, {}]]]}, {"name": "avg_pool", "class_name": "TimeDistributed", "config": {"name": "avg_pool", "trainable": true, "layer": {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "trainable": true, "pool_size": [7, 7], "padding": "valid", "strides": [7, 7], "data_format": "channels_last"}}}, "inbound_nodes": [[["activation_49", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}}, "inbound_nodes": [[["avg_pool", 0, 0, {}]]]}, {"name": "dense_class_4", "class_name": "TimeDistributed", "config": {"name": "dense_class_4", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "dense_regress_4", "class_name": "TimeDistributed", "config": {"name": "dense_regress_4", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_class_4", 0, 0], ["dense_regress_4", 0, 0]]}, "keras_version": "2.0.3", "backend": "tensorflow"}